; domain
(define (domain ferry)
(:types car location - object)
   (:predicates (not-eq ?x ?y - object)
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?o1 ?o2)
       :precondition (and (not-eq ?o1 ?o2) (at-ferry ?o1))
       :effect (and  (at-ferry ?o2)
		     (not (at-ferry ?o1))))

   (:action board
       :parameters (?o1 ?o2)
       :precondition  (and  (at ?o1 ?o2) (at-ferry ?o2) (empty-ferry))
       :effect (and (on ?o1)
		    (not (at ?o1 ?o2)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?o1  ?o2)
       :precondition  (and  (on ?o1) (at-ferry ?o2))
       :effect (and (at ?o1 ?o2)
		    (empty-ferry)
		    (not (on ?o1)))))

; problem
(define (problem ferry-l6-c9)
  (:domain ferry)
  (:objects l1 -  location l0 -  location l2 -  location l4 -  location l3 -  location l5 -  location c0 -  car c1 -  car c2 -  car c3 -  car c4 -  car c5 -  car c6 -  car c7 -  car c8 -  car )
  (:init (not-eq l3 l2) (not-eq l5 l1) (not-eq l5 l3) (not-eq l5 l0) (at c1 l2) (not-eq l1 l3) (not-eq l1 l0) (not-eq l4 l2) (not-eq l1 l2) (not-eq l1 l4) (not-eq l4 l0) (not-eq l4 l3) (not-eq l2 l3) (not-eq l4 l1) (not-eq l2 l0) (at c3 l3) (not-eq l1 l5) (not-eq l4 l5) (at c6 l2) (not-eq l2 l1) (not-eq l2 l4) (at c2 l1) (not-eq l3 l4) (at c7 l5) (not-eq l5 l4) (not-eq l2 l5) (at c8 l3) (not-eq l0 l4) (not-eq l3 l1) (not-eq l0 l5) (not-eq l0 l3) (at c5 l1) (not-eq l3 l0) (not-eq l3 l5) (not-eq l0 l1) (not-eq l5 l2) (not-eq l0 l2) (at c0 l1) (at-ferry l3) (on c4) )
  (:goal (and (not-eq l3 l2)(not-eq l5 l1)(not-eq l5 l3)(not-eq l5 l0)(at c1 l2)(not-eq l1 l3)(not-eq l1 l0)(not-eq l4 l2)(not-eq l1 l2)(not-eq l1 l4)(not-eq l4 l0)(not-eq l4 l3)(not-eq l2 l3)(not-eq l4 l1)(not-eq l2 l0)(at c3 l3)(not-eq l1 l5)(not-eq l4 l5)(not-eq l2 l1)(not-eq l2 l4)(at c2 l1)(not-eq l3 l4)(at c7 l5)(not-eq l5 l4)(not-eq l2 l5)(at c8 l3)(not-eq l0 l4)(not-eq l3 l1)(not-eq l0 l5)(not-eq l0 l3)(at c5 l1)(not-eq l3 l0)(not-eq l3 l5)(not-eq l0 l1)(not-eq l5 l2)(not-eq l0 l2)(at c0 l1)(at c4 l0)(at c6 l5)(empty-ferry )(at-ferry l1)(not (at-ferry l0))(not (at-ferry l2))(not (at-ferry l3))(not (at-ferry l4))(not (at-ferry l5))(not (at c0 l0))(not (at c0 l2))(not (at c0 l3))(not (at c0 l4))(not (at c0 l5))(not (at c1 l0))(not (at c1 l1))(not (at c1 l3))(not (at c1 l4))(not (at c1 l5))(not (at c2 l0))(not (at c2 l2))(not (at c2 l3))(not (at c2 l4))(not (at c2 l5))(not (at c3 l0))(not (at c3 l1))(not (at c3 l2))(not (at c3 l4))(not (at c3 l5))(not (at c4 l1))(not (at c4 l2))(not (at c4 l3))(not (at c4 l4))(not (at c4 l5))(not (at c5 l0))(not (at c5 l2))(not (at c5 l3))(not (at c5 l4))(not (at c5 l5))(not (at c6 l0))(not (at c6 l1))(not (at c6 l2))(not (at c6 l3))(not (at c6 l4))(not (at c7 l0))(not (at c7 l1))(not (at c7 l2))(not (at c7 l3))(not (at c7 l4))(not (at c8 l0))(not (at c8 l1))(not (at c8 l2))(not (at c8 l4))(not (at c8 l5))(not (on c0))(not (on c1))(not (on c2))(not (on c3))(not (on c4))(not (on c5))(not (on c6))(not (on c7))(not (on c8)))))

; plan
1. (sail l3 l0)
   deleted: (at-ferry l3)
   added: (at-ferry l0)
   goals met: 93 of 100
2. (debark c4 l0)
   deleted: (on c4)
   added: (at c4 l0) (empty-ferry)
   goals met: 96 of 100
3. (sail l0 l2)
   deleted: (at-ferry l0)
   added: (at-ferry l2)
   goals met: 96 of 100
4. (board c6 l2)
   deleted: (at c6 l2) (empty-ferry)
   added: (on c6)
   goals met: 95 of 100
5. (sail l2 l5)
   deleted: (at-ferry l2)
   added: (at-ferry l5)
   goals met: 95 of 100
6. (debark c6 l5)
   deleted: (on c6)
   added: (at c6 l5) (empty-ferry)
   goals met: 98 of 100
7. (sail l5 l1)
   deleted: (at-ferry l5)
   added: (at-ferry l1)
   goals met: 100 of 100
